Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine.PolyLine Property
 The path of the line.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolyLine PolyLine { get; set; }
Public Property PolyLine As PolyLine
	Get
	Set
Property Value
Type: PolyLine
See Also
Reference
GraphicPolyLine Class
Tekla.Structures.Model.UI Namespace